examples/mock-requests/iti41-request-sample.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ITI-41 Provide and Register Document Set-b Request
  
  NOTE: This is a SIMPLIFIED representation of the SOAP envelope structure.
  Real ITI-41 requests use MTOM (MIME Multipart) encoding with:
  - Multipart/related Content-Type
  - SOAP envelope in first part
  - CCD document(s) as binary attachments in subsequent parts
  - XOP:Include references linking metadata to attachments
  
  For actual ITI-41 submission examples using Python, see:
  - examples/tutorials/05-mock-endpoints.md
  - Integration tests: tests/integration/test_iti41_endpoint_flow.py
  
  This file shows the SOAP structure only (without MTOM packaging).
-->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:xop="http://www.w3.org/2004/08/xop/include"
               xmlns:ihe="urn:ihe:iti:xds-b:2007"
               xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0"
               xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
  <soap:Header>
    <!-- WS-Addressing Headers (if required) -->
    <!-- <wsa:Action>urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action> -->
  </soap:Header>
  <soap:Body>
    <ihe:ProvideAndRegisterDocumentSetRequest>
      
      <!-- Submission Set Metadata -->
      <rim:SubmitObjectsRequest>
        <rim:RegistryObjectList>
          
          <!-- ExtrinsicObject: Document Metadata -->
          <rim:ExtrinsicObject id="Document01" 
                               mimeType="text/xml"
                               objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
            <!-- Document ID -->
            <rim:Slot name="creationTime">
              <rim:ValueList>
                <rim:Value>20250108150000</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Slot name="languageCode">
              <rim:ValueList>
                <rim:Value>en-US</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Slot name="sourcePatientId">
              <rim:ValueList>
                <rim:Value>PAT12345^^^&amp;1.2.3.4.5&amp;ISO</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            
            <!-- Document Title -->
            <rim:Name>
              <rim:LocalizedString value="Continuity of Care Document"/>
            </rim:Name>
            
            <!-- Document Description -->
            <rim:Description>
              <rim:LocalizedString value="CCD for patient John Doe"/>
            </rim:Description>
            
            <!-- Classification: Document Type Code -->
            <rim:Classification 
              classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a"
              classifiedObject="Document01"
              nodeRepresentation="34133-9">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>LOINC</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Summarization of Episode Note"/>
              </rim:Name>
            </rim:Classification>
            
            <!-- Classification: Format Code -->
            <rim:Classification 
              classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d"
              classifiedObject="Document01"
              nodeRepresentation="urn:ihe:pcc:xphr:2007">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>IHE PCC</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="IHE XPHR Format"/>
              </rim:Name>
            </rim:Classification>
            
            <!-- External Identifier: Patient ID -->
            <rim:ExternalIdentifier 
              identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427"
              registryObject="Document01"
              value="PAT12345^^^&amp;1.2.3.4.5&amp;ISO">
              <rim:Name>
                <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
            
            <!-- External Identifier: Unique ID -->
            <rim:ExternalIdentifier 
              identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
              registryObject="Document01"
              value="2.16.840.1.113883.3.72.5.9.100.12345">
              <rim:Name>
                <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
          </rim:ExtrinsicObject>
          
          <!-- RegistryPackage: Submission Set -->
          <rim:RegistryPackage id="SubmissionSet01">
            <rim:Slot name="submissionTime">
              <rim:ValueList>
                <rim:Value>20250108150000</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            
            <rim:Name>
              <rim:LocalizedString value="CCD Submission"/>
            </rim:Name>
            
            <!-- External Identifier: Submission Set Unique ID -->
            <rim:ExternalIdentifier 
              identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
              registryObject="SubmissionSet01"
              value="2.16.840.1.113883.3.72.5.9.200.54321">
              <rim:Name>
                <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
            
            <!-- External Identifier: Source ID -->
            <rim:ExternalIdentifier 
              identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
              registryObject="SubmissionSet01"
              value="1.2.3.4.5.6.7">
              <rim:Name>
                <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
            
            <!-- External Identifier: Patient ID -->
            <rim:ExternalIdentifier 
              identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446"
              registryObject="SubmissionSet01"
              value="PAT12345^^^&amp;1.2.3.4.5&amp;ISO">
              <rim:Name>
                <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
          </rim:RegistryPackage>
          
          <!-- Association: Links Document to Submission Set -->
          <rim:Association 
            associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember"
            sourceObject="SubmissionSet01"
            targetObject="Document01">
            <rim:Slot name="SubmissionSetStatus">
              <rim:ValueList>
                <rim:Value>Original</rim:Value>
              </rim:ValueList>
            </rim:Slot>
          </rim:Association>
          
          <!-- Classification: Submission Set Classification -->
          <rim:Classification 
            classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
            classifiedObject="SubmissionSet01"/>
          
        </rim:RegistryObjectList>
      </rim:SubmitObjectsRequest>
      
      <!-- 
        Document Attachment Reference
        
        In real MTOM encoding, this would be:
        <ihe:Document id="Document01">
          <xop:Include href="cid:document-part-1@example.org"/>
        </ihe:Document>
        
        Where the actual CCD XML content is in a separate MIME part
        with Content-ID: <document-part-1@example.org>
        
        For testing the mock endpoint, the endpoint extracts and validates
        the MTOM structure but doesn't deeply parse document content.
      -->
      <ihe:Document id="Document01">
        <!-- 
          PLACEHOLDER: In real MTOM requests, this would be:
          <xop:Include href="cid:document-content@example.org"/>
          
          The mock server validates MTOM structure and accepts requests
          with proper multipart encoding.
        -->
        <xop:Include href="cid:document-content@example.org"/>
      </ihe:Document>
      
    </ihe:ProvideAndRegisterDocumentSetRequest>
  </soap:Body>
</soap:Envelope>
